Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>RA_AdditionalFields_TradingPartner</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_TradingPartners</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_SearchTerm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>RA_AdditionalFields_СписокГрузополучателей</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/Партнеры/Forms/ФормаЭлементаРеквизитыКонтрагента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	RA_AdditionalFields_ДобавитьЭлементыНаФорму();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_ДобавитьЭлементыНаФорму()
	
	//Добавим группу Bayer
	ГруппаBayer = Элементы.Вставить("РА_ГруппаBayer", Тип("ГруппаФормы"), Элементы.ГруппаОбщаяИнформация,
		Элементы.ГруппаОтношенияДополнительно);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check bsl-legacy-check-expression-type
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина;
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "Bayer";
	//@skip-check bsl-legacy-check-expression-type
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаBayer.Поведение = ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаBayer.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаBayer.Скрыть();

	НовыйЭлемент = Элементы.Добавить("RA_КодSAP", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодSAP";
	НовыйЭлемент.Ширина = 28;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина = 28;

	НовыйЭлемент = Элементы.Добавить("RA_TradingPartner", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_TradingPartner";
	НовыйЭлемент.Ширина = 28;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина = 28;
	
	НовыйЭлемент = Элементы.Добавить("RA_SearchTerm", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_SearchTerm";
	НовыйЭлемент.Ширина = 28;

	Страница_Грузополучатели = Элементы.Добавить("RA_Страница_Грузополучатели", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	Страница_Грузополучатели.Вид = ВидГруппыФормы.Страница;
	Страница_Грузополучатели.Заголовок = "Грузополучатели";
	Страница_Грузополучатели.ПутьКДаннымЗаголовка = "Объект.RA_AdditionalFields_СписокГрузополучателей.КоличествоСтрок";
	
	RA_Таблица_Грузополучатели = Элементы.Добавить("RA_Таблица_Грузополучатели", Тип("ТаблицаФормы"), Страница_Грузополучатели);
	RA_Таблица_Грузополучатели.ПутьКДанным = "Объект.RA_AdditionalFields_СписокГрузополучателей";
	
	НовыйЭлемент  = Элементы.Добавить("RA_Таблица_Грузополучатели_Грузополучатель", Тип("ПолеФормы"), RA_Таблица_Грузополучатели);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_СписокГрузополучателей.Грузополучатель";
	
КонецПроцедуры

#КонецОбласти
